Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.ExtensionLineTypes Enumeration
 The extension line types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ExtensionLineTypes
Public Enumeration ExtensionLineTypes
Members
Member name | Value | Description
No | 0 |  The extension lines are visible.
Yes | 1 |  The extension lines of a dimension are not visible.
NotOnGridlines | 2 |  The extension lines are not visible when the lines are on a grid.
See Also
Reference
Tekla.Structures.Drawing Namespace